from dataclasses import dataclass


class Auth:
    greeting = {
        'ru': (
            'Приветствуем в пространстве Благодарности!\n\n'
            'Я чат-бот Wellbeing Company, буду твоим полезным помощником и помогу тебе:\n'
            '✅ быстро и удобно отправить твои теплые слова коллегам;\n'
            '✅ распределять и считать сердечки💚\n'
            '✅ получать благодарности от сотрудников за твои добрые поступки;\n'
            '✅ получать полезную информацию и практики для поддержания себя в ресурсном состоянии😎\n\n'
            'Для старта нужно идентифицировать тебя через рабочую почту. Напиши, пожалуйста, свою почту здесь'
        ),
        'ua': (
            f'Вітаємо тебе у просторі Вдячності! 👋\n\n'
            f'Я чат-бот Wellbeing Company, буду твоїм корисним помічником та допоможу тобі:\n'
            f'✅ швидко та зручно відправити твої теплі слова колегам\n'
            f'✅ розподіляти та рахувати wellcoin-и 💚\n'
            f'✅ отримувати подяки від співробітників за твої добрі вчинки\n'
            f'✅ отримувати корисну інформацію та практики для підтримки себе у ресурсному стані 😎\n\n'
            f'Для старту треба ідентифікувати тебе через робочу пошту 📩\n\n'
            f'Натисни на кнопку "Пошук 🔍", для швидкого пошуку пошти, або відправ текстове повідомлення.'
        ),
    }
    auth = {
        'ru': (
            'Для старта нужно идентифицировать тебя через рабочую почту. Напиши, пожалуйста, свою почту здесь'
        ),
        'ua': f'Натисни на кнопку "Пошук 🔍", для швидкого пошуку пошти, або відправ текстове повідомлення.'
    }
    your_name_is = {
        'ru': (
            'Нашел 🎉! Тебя зовут {}?'
        ),
        'ua': (
            'Знайшов🎉! Тебе звати {}?'
        )
    }
    email_not_found = {
        'ua': (
            'Хмм 🧐... Не знайшов такої адреси, спробуй відправити ще раз.'
        ),
        'ru': (
            'Хмм 🧐... Не нашел, почта точно указана правильно? Напиши, пожалуйста, повторно.'
        )
    }
    email_is_busy = {
        'ua': (
            'Хмм 🧐... Ця адреса вже зайнята {}'
        ),
        'ru': (
            'Хмм 🧐... Почта уже занята {}'
        )
    }


class Start:

    not_complete_auth = {'ua': 'Ти не пройшов авторизацію. Давай виправим це!',
                         'ru': 'Ти не прошел авторизацию. Давай исправим это!'}
    complete_auth = {'ua': f'Вітаємо тебе у просторі Вдячності! Ти знаходишся в головному меню.',
                     'ru': f'Приветсвуєм тебя в пространстве Благодарности! Ты находишься в главном меню.'}
    after_auth_text = {
        'ua': (
            'Дякуємо за реєстрацію 💚\n\n'
            'Дослідження показують, що час, який людина присвячує вдячності, '
            'може зробити її щасливішою та навіть здоровішою! 💪\n\n'
            'Радіємо, що ти усвідомлено ставишся до свого життя і знаходиш час, '
            'щоб подякувати своїм колегам за добрі справи, які вони зробили для тебе!🙏'
        ),
        'ru': (
            'Спасибо за регистрацию 💚\n\n'
            'Исследования показывают, что время, которое человек посвящает благодарности,  '
            'может сделать его счастливее и даже здоровее! 💪\n\n'
            'Радуемся, что ты осознанно относишься к своей жизни и находишь время, чтобы '
            'поблагодарить своих коллег за добрые дела, которые они сделали для тебя! 🙏'
        )
    }


class Send:
    limit_over = {'ua': 'Ти вже використав 100/100 wellcoin-ів 💚 за цей місяць. Дочекайся наступного поповнення!',
                  'ru': 'Ты уже использовал 100/100 wellcoin-ы 💚 за этот месяц. Дождись следующего пополнения!'}
    list_of_people = {
        'ua': (
            'Круто! Сьогодні ти зробиш когось щасливим!\nДякуємо тобі 💚\n\n'
            'Щоб почати натисни на кнопку "Список колег"'
        ),
        'ru': (
            'Круто! Сегодня ты сделаешь кого-нибудь счастливым!\nСпасибо тебе 💚\n\n'
            'Чтобы начать, нужно нажать кнопку "Список колег"'
        ),
    }
    select_command = {'ua': 'Обери команду колег',
                      'ru': 'Выбери команду коллег'}
    select_user = {'ua': 'Вибери зі списку того, кому ти хочеш направити wellcoin-и 💚',
                   'ru': 'Выбери из списка того, кому ты хочешь направить сердца 💚'}
    search_people = {
        'ua': (
            'Ти також можеш знайти колегу за його ім\'ям, використавши пошук. '
            'Для цього натисни кнопку "Пошук" та почни вводити ім\'я чи прізвище колеги.'
        ),
        'ru': (
            'Ты также можешь найти коллегу по его имени, используя поиск.'
        )
    }
    not_found_user = {
        'ua': (
            'Хмм... схоже цей користувач ще не зареєструвався у боті, скористайся кнопкою "Список колег",'
            ' або настисни "Пошук 🔍", щоб спробувати знову.'
        ),
        'ru': (
            'Хмм... похоже этот пользователь еще не зарегистрировался в боте, воспользуйся кнопкой "Список коллег",'
            ' или нажми "Искать 🔍", чтобы попробовать снова.'
        )
    }
    word_of_thanks = {
        'ua': (
            'Напиши свої теплі слова вдячності тут. Спробуй подарувати свою вдячність від серця ❤.'
        ),
        'ru': (
            'Напиши свои теплые слова благодарности здесь. Попробуй подарить свою благодарность от сердца❤'
        )
    }
    send_to_self = {'ua': 'Відправляти wellcoin-и собі заборонено', 'ru': 'Отправлять wellcoin-ы себе запрещено'}
    how_much_coins = {
        'ua': 'Скільки wellcoin-ів ти бажаєш відправити? В тебе є {} 👇',
        'ru': 'Сколько сердец ты желаешь отправить? У тебя есть {} 👇'
    }
    not_a_number = {'ua': 'Не схоже на число... Спробуйте ще раз!', 'ru': 'Не похоже на число... Попробуйте еще раз!'}
    you_only_have = {'ua': 'Занадто багато... Ти маєш лише {}', 'ru': 'Слишком много... У тебя только {}'}
    too_small = {'ua': 'Занадто мало... Спробуй ще раз!', 'ru': 'Слишком мало... Попробуй еще раз!'}
    reg_coins = {
        'ua': (
            'Чудово, зафіксовано передачу {} wellcoin-ів ✅.\n\n'
            'Вкажи, за яку саме цінність ти вдячна/-ний? '
            'Це може бути одна або декілька цінностей Компанії або твоя власна.\n\n' 
            'Натисни на цінності зі списку, які хочеш обрати, а потім натисни "✅Відправити wellcoin-и".'
        ),
        'ru': (
            'Прекрасно, зафиксирована передача {} wellcoin-ов ✅.\n\n'
            'За какую именно ценность ты благодарен/а? Это может быть одна или несколько  '
            'ценностей компании или твоя собственная.\n\nНажми на все ценности из списка, которые ' 
            'хочешь выбрать, а далее кнопку "✅Отправить wellcoin-ы".'
        )
    }
    select_values = {'ua': 'Обрані цінності: {}', 'ru': 'Выбранные ценности: {}'}
    what_a_value = {'ua': 'Вкажи, будь ласка, що це?', 'ru': 'Укажи, пожалуйста, что это?'}
    all_is_good = {'ua': 'Все готово, відправити wellcoin-и?', 'ru': 'Все готово, отправить wellcoin-ы?'}
    thank_for = {'ua': 'Дякуємо! Вдячність та wellcoin-и успішно надіслано ✅\n',
                 'ru': 'Спасибо! Благодарность и wellcoin-ы успешно отправлены ✅\n'}
    use_all_coins = {'ua': 'В цьому місяці ти використав всі 100 wellcoin-ів',
                     'ru': 'В этом месяце ты использовал все 100 wellcoin-ов'}
    coins_remain = {'ua': 'В цьому місяці в тебе є ще {} wellcoin-ів, якими ти можеш поділитися!',
                    'ru': 'В этом месяце у тебя есть еще {} wellcoin-ов, которыми ты можешь поделиться!'}

    message_thank = {
        'ua': (
            '👉💚 Переказ {} wellcoin-ів\n\n'
            'Вітаємо! Тобі подарували подяку від {} '
            'за цінність: <b>{}</b>💐\n\n<i>{}</i>'
        ),
        'ru': (
             '👉💚 Перевод {} wellcoin-ов\n\n'
             'Поздравляем! Тебе подарили благодарность от {}'
             'за ценность: <b>{}</b>💐\n\n<i>{}</i>'
         )
    }


class History:
    no_coins = {'ua': 'Тобі ще не надіслали wellcoin-и 😥', 'ru': 'Тебе еще не прислали wellcoin-ы 😥'}
    no_thank = {'ua': 'Ще не зафіксовано перекази від тебе😥', 'ru': 'Ещё не зафиксированы переводы от тебя 😥'}
    mini_stat = {
        'ua': 'Ви зробили {} та отримали {} переказів  💚 за весь час'
    }
    no_transaction = {'ua': 'Більше немає переказів', 'ru': 'Больше нет переводов'}
    hist_for_u = {'ua': 'Історія переказів для тебе', 'ru': 'История благодарности для тебя'}
    my_hist = {'ua': 'Моя історія переказів', 'ru': 'Моя история благодарности'}
    frm = {'ua': 'від', 'ru': 'от'}
    to = {'ua': 'для', 'ru': 'для'}


@dataclass
class Text:
    auth = Auth()
    start = Start()
    send = Send()
    history = History()

